есть задачи котрые не успели решить есть дз:
"""
Нарисовать в консоли ёлку спросив
у пользователя количество рядов.
Два варианта решения задачи.
"""
row_line = int(input("Сколько рядов у ёлки? "))
STEP_LINE = 2
for i in range(1, row_line * 2, STEP_LINE):
    print(f'{"*" * i:^{row_line * 2}}')
print('\n', '-' * 20, '\n')
for i in range(1, row_line + 1):
    spaces = " " * (row_line - i)
    stars = "*" * (2 * i - 1)
    print(spaces + stars)

"""
Выведите в консоль таблицу умножения от 2х2 до 9х10 как на школьной тетрадке.
Только такое решение
Эта задача заставила помучеться 
"""
LOWER_LIMIT = 2
UPPER_lIMIT = 10
COLUMN = 4
for i in range(LOWER_LIMIT, UPPER_lIMIT, COLUMN):
    for j in range(LOWER_LIMIT, UPPER_lIMIT + 1):
        for k in range(i, i + COLUMN):
            if j == UPPER_lIMIT and k == i + COLUMN - 1:
                print(f'{k:>} x {j:>2} = {k * j:>2}\n\n', end='')
            elif k == i + COLUMN - 1:
                print(f'{k:>} x {j:>2} = {k * j:>2}\n', end='')
            else:
                print(f'{k:>} x {j:>2} = {k * j:>2}\t\t', end='')

"""
Треугольник существует только тогда, когда сумма любых двух его сторон больше третьей. Дано a, b, c —
стороны предполагаемого треугольника. Требуется сравнить длину каждого отрезка-стороны с суммой
двух других. Если хотя бы в одном случае отрезок окажется больше суммы двух других, то треугольника
с такими сторонами не существует. Отдельно сообщить является ли треугольник разносторонним,
равнобедренным или равносторонним.
"""
a = int(input('Введите строронну а: '))
b = int(input('Введите строронну b: '))
c = int(input('Введите строронну c: '))
if a + b < c or a + c < b or b + c < a:
    print('Треугольник не существует')
else:
    print('Треугольник существует')
    if a == b != c or a == c != b or c == b != a:
        print('И являеться равнобедренный треугольник')
    elif a == b == c:
        print('И являеться равнобедренный равносторонним треугольником')
    else:
        print('И являеться равнобедренный разносторонним треугольником')

""" дз 1:
Треугольник существует только тогда, когда сумма любых двух его сторон больше третьей. Дано a, b, c —
стороны предполагаемого треугольника. Требуется сравнить длину каждого отрезка-стороны с суммой
двух других. Если хотя бы в одном случае отрезок окажется больше суммы двух других, то треугольника
с такими сторонами не существует. Отдельно сообщить является ли треугольник разносторонним,
равнобедренным или равносторонним.
"""
a = int(input('Введите строронну а: '))
b = int(input('Введите строронну b: '))
c = int(input('Введите строронну c: '))
if a + b < c or a + c < b or b + c < a:
    print('Треугольник не существует')
else:
    print('Треугольник существует')
    if a == b != c or a == c != b or c == b != a:
        print('И являеться равнобедренный треугольник')
    elif a == b == c:
        print('И являеться равнобедренный равносторонним треугольником')
    else:
        print('И являеться равнобедренный разносторонним треугольником')

"""
Напишите код, который запрашивает число и сообщает является ли оно простым или составным.
Используйте правило для проверки: «Число является простым, если делится нацело только на единицу
и на себя». Сделайте ограничение на ввод отрицательных чисел и чисел больше 100 тысяч.
"""
temp  = True
while True:
    user_namber = int(input())
    if 1 < user_namber < 1000: break
for i in range(2, user_namber):
    if user_namber % i == 0:
        temp = False
if temp: print('Число простое')
else: print('Состовное')

""" дз2:
Программа загадывает число от 0 до 1000. Необходимо угадать число за 10 попыток. Программа
должна подсказывать «больше» или «меньше» после каждой попытки. Для генерации случайного
числа используйте код:
from random import randint
num = randint(LOWER_LIMIT, UPPER_LIMIT)
Тут программа работает корява я знаю при каких условиях её можно сломать но обещаю пофиксить
"""
from random import randint
low_limit = 1
upper_limit = 1000
num = randint(low_limit, upper_limit)
tem_low_limit = low_limit
tem_upper_limit = upper_limit
a = 0
while a < 10:
    print(f'Вы задумали число {num} если нет то оно > или < или =')
    user_send = input('->')
    if user_send == '=':
        print('im win!')
        break
    elif user_send == '>':
        tem_low_limit = int((tem_low_limit + tem_upper_limit) / 2)
        num = randint(tem_low_limit, tem_upper_limit)
    elif user_send == '<':
        tem_upper_limit = int((tem_low_limit + tem_upper_limit) / 2)
        num = randint(tem_low_limit, tem_upper_limit)
    a += 1
    print(a)

